{
    "jobTitle": "Desenvolvedor Web Full Stack @ MEO",
    "description": "Desenvolvedor Web Full Stack com uma base sólida em tecnologias de front-end e back-end. Experiente na criação de aplicações responsivas e centradas no utilizador, bem como na integração de APIs RESTful. Com conhecimento em virtualização de servidores, design de bases de dados e otimização de desempenho. Habituado a entregar código escalável e sustentável em ambientes colaborativos.",
    "prog-langs": "Linguagens de Programação",
    "skills": "Competências Relevantes",
    "languages": "Idiomas",
    "pt": "Português - Nativo",
    "en": "Inglês - Fluente",
    "experience": "Experiência Profissional",
    "history": "Histórico Académico",
    "accomplishments": "Conquistas",
    "meoTitle": "Estagiário Full Stack Web Developer @ MEO",
    "meoDate": "[Setembro 2024 - Atual]",
    "meoInfo": "<ul><li>Desenvolvimento e manutenção de funcionalidades em Laravel para o Portal de Operações utilizado por equipas internas;</li><li>Conceção e implementação de queries e otimizações de base de dados para suportar processos críticos de negócio;</li><li>Desenvolvimento de mecanismos de auditoria automatizada para routers das redes IP, com o objetivo de garantir conformidade, identificar desvios de configuração e otimizar a gestão da infraestrutura de rede;</li><li>Configuração e gestão de ambientes de desenvolvimento usando Proxmox VE e contentores Docker;</li><li>Colaboração com a equipa de Operações para recolher requisitos e entregar soluções centradas no utilizador;</li><li>Aplicação de práticas modernas de desenvolvimento, incluindo controlo de versões com Git e gestão ágil de tarefas;</li></ul>",
    "redlightTitle": "Estagiário de Verão em Desenvolvimento Web @ RedLight Software",
    "redlightDate": "[Junho - Agosto 2024]",
    "redlightInfo": "<ul><li>Contribuição no design e desenvolvimento de um <a target='_blank' href='https://redlight.dev/project/vive-na-boa/'>jogo web</a> para uma instituição de solidariedade social, utilizando tecnologias web modernas;</li><li>Colaboração numa equipa ágil com Ruby on Rails e React para criar interfaces responsivas e interativas;</li><li>Desenvolvimento e integração de APIs RESTful para suportar conteúdo dinâmico e interações dos utilizadores;</li><li>Participação em reuniões diárias, planeamento de sprints e revisões de código, em estreita colaboração com developers, designers e o gestor de projeto;</li><li>Criação de testes unitários e end-to-end para garantir a fiabilidade da aplicação;</li><li>Utilização de Git para controlo de versões e contributo para pipelines CI/CD com GitLab e Docker;</li><li>Aplicação de feedback de developers seniores para melhorar a qualidade do código e adotar boas práticas da indústria;</li></ul>",
    "degreeTitle": "Licenciatura em Engenharia Informática",
    "degreeDate": "[2021 - 2024]",
    "degreeInfo": "<p>Instituição: Universidade de Coimbra - FCTUC\n[2021-2024]</p>",
    "enei": "Participante na edição de 2023 do ENEI (Encontro Nacional de Estudantes de Informática)",
    "ebec": "Membro da equipa que conquistou o 3.º lugar na EBEC - European BEST Engineering Competition, em março de 2022",
    "hosted": "Este currículo está hospedado em:",
    "source": "Código-fonte:"
}