{
    "jobTitle": "Full Stack Web Developer @ MEO",
    "description": "Full-Stack Web Developer with a strong foundation in front-end and back-end technologies. Skilled in building responsive, user-focused applications and integrating RESTful APIs. Experienced in server virtualization, database design, and performance optimization. Adept at delivering scalable, maintainable code in collaborative environments.",
    "prog-langs": "Programming Languages",
    "skills": "Relevant Skills",
    "languages": "Languages",
    "pt": "Portuguese - Native",
    "en": "English - Fluent",
    "experience": "Work Experience",
    "history": "Education History",
    "accomplishments": "Accomplishments",
    "meoTitle": "Full Stack Web Developer Intern @ MEO",
    "meoDate": "[September 2024 - Current]",
    "meoInfo": "<ul><li>Developed and maintained Laravel-based features for the Operations Portal used by internal teams;</li><li>Designed and implemented database queries and optimizations to support business-critical workflows;</li><li>Developed of automated auditing mechanisms for IP network routers, aimed at ensuring compliance, identifying configuration deviations, and optimizing network infrastructure management;</li><li>Deployed and managed development environments using Proxmox VE and Docker containers;</li><li>Collaborated with the Operations team to gather requirements and deliver user-centric solutions;</li><li>Applied modern development practices including version control with Git and Agile task management;</li></ul>",
    "redlightTitle": "Web Development Summer Intern @ RedLight Software",
    "redlightDate": "[June - August 2024]",
    "redlightInfo": "<ul><li>Contributed to the design and development of a <a target='_blank' href='https://redlight.dev/project/vive-na-boa/'>web-based game</a> for a social solidarity organization using modern web technologies;</li><li>Collaborated in an Agile team using Ruby on Rails and React to build responsive, interactive UI components;</li><li>Developed and integrated RESTful APIs to support dynamic content and user interactions;</li><li>Participated in daily stand-ups, sprint planning, and code reviews, working closely with developers, designers, and the project manager;</li><li>Wrote unit and end-to-end tests to ensure application reliability and maintainability;</li><li>Used Git for version control and contributed to CI/CD workflows with GitLab and Docker;</li><li>Applied feedback from senior developers to improve code quality and adopt industry best practices;</li></ul>",
    "degreeTitle": "Bachelor's Degree in Informatics Engineering (Computer Science)",
    "degreeDate": "[2021 - 2024]",
    "degreeInfo": "Institution: University of Coimbra - FCTUC",
    "enei": "Participant in the 2023 edition of ENEI (National Meeting of Computer Science Students)",
    "ebec": "Member of the team that placed 3rd at EBEC - European BEST Engineering Competition, on March of 2022",
    "hosted": "This curriculum is hosted on:",
    "source": "Source code:"
}